//神TM的多维数组初始化......
#ifdef USE_08_01

char char_value[3][6][4][5] = {
	{0},	//[0]
	{
		{0},
		{
			{0} ,
			{0,' '},
			{0,0,0,'x'},
		},
		{
			{0},
			{0},
			{0,0,0,'A'},
		},
		{
			{0},
			{0},
			{0,0,0xf3},
		},
		{
			{0},
			{0},
			{0,0,0,'\n'},
		}
	},		//[1]
	{
		{0},
		{
			{0},
			{0,0,0320},
		},
		{
			{0},
			{0,'0'},
			{0,0,'\''},
			{0,'\121'},
		},
		{0},
		{
			{0},
			{0},
			{0},
			{0,0,'3',3},
		},
		{
			{0},
			{0},
			{0},
			{0,0,0,0,125},
		}
	}		//[2]
};

//driver.c
#include<stdio.h>

extern char char_value[3][6][4][5];

int main(void) {
	char *cp;
	cp = &char_value[0][0][0][0];
	for (; cp < &char_value[2][5][3][5];
		printf("%d:%x\n", cp - &char_value[0][0][0][0], *cp++)) {
		continue;
	}
	getchar();
}
#endif // USE_08_01